In [59]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [5]:
import numpy as np

In [7]:
np.unique(df['col2'])

array([444, 555, 666], dtype=int64)

In [9]:
df['col2'].nunique()

3

In [11]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [33]:
df[(df['col1']>2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [39]:
def vezes(x):
    return x * 2

In [41]:
df['col1'].apply(vezes)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [43]:
df.apply(vezes)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [45]:
df['col1'].apply(lambda x: x*x)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [49]:
del df['col2']

In [51]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [53]:
df.columns

Index(['col1', 'col3'], dtype='object')

In [55]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [61]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [65]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [67]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [69]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [71]:
df.pivot_table(values='D',index=['A' , 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN